work on missing data in a file

In [2]:
import numpy as np 
import pandas as pd
n=np.array([1,None,3,4])
n

array([1, None, 3, 4], dtype=object)

In [5]:
1+np.nan

nan

In [6]:
0*np.nan

nan

In [7]:
# so take nan in place of none
n[1]=np.nan
n

array([1, nan, 3, 4], dtype=object)

In [9]:
sum(n),min(n),max(n)

(nan, 1, 4)

In [10]:
np.nansum(n),np.nanmin(n),np.nanmax(n)

(8, 1, 4)

# Nan and None in pandas both have their place
pandas built to handle the two of them nearly interchangeably,converting between them were appropriat

In [11]:
pd.Series([1,None,np.nan,2])

0    1.0
1    NaN
2    NaN
3    2.0
dtype: float64

In [12]:
x=pd.Series(range(3),dtype=int)
x

0    0
1    1
2    2
dtype: int64

In [13]:
x[0]

0

# This is how we replace any value with null values
x[1]=None
x

In [15]:
x[1]=None
x

0    0.0
1    NaN
2    2.0
dtype: float64

#operating on null values                     
isnull() : generate a boolean mask                    
notnull(): opposite of isnull()                        
dropna() : drop null values columns                  
fillna() : fill null values with something

In [17]:
# Detecting null values
df=pd.read_csv(r'/home/mohit/Desktop/4achivers/bank_client_information.csv')

In [19]:
data=pd.Series([1,np.nan,'hello',None])
data.isnull() # gives you boolean values

0    False
1     True
2    False
3     True
dtype: bool

In [20]:
data.info() # 4 enteries but only 2 non null means 2 values are null in this

<class 'pandas.core.series.Series'>
RangeIndex: 4 entries, 0 to 3
Series name: None
Non-Null Count  Dtype
--------------  -----
2 non-null      object
dtypes: object(1)
memory usage: 160.0+ bytes

In [21]:
data.notnull()

0     True
1    False
2     True
3    False
dtype: bool

In [22]:
# give me the data whixh is notnull
data[data.notnull()]

0        1
2    hello
dtype: object

In [23]:
# give me the data which is null
data[data.isnull()]

1     NaN
3    None
dtype: object

In [24]:
# Dropping null values from the data
data.dropna() # it will simple remove the null values from array

0        1
2    hello
dtype: object

In [25]:
df=pd.DataFrame([[1,np.nan,2],
                [2,3,5],
                [np.nan,4,6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [26]:
# it simple remove those values
df.dropna()

     0    1  2
1  2.0  3.0  5

In [28]:
df[df.notnull()]

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [29]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [30]:
# remove columns which have null values
df.dropna(axis=1)

   2
0  2
1  5
2  6

In [31]:
# This is how we add null values
df[3]=np.nan

In [32]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [35]:
# thresh specify a minimum number of non-null values for the row/column to be kept
df.dropna(axis=0,thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [36]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [41]:
df.dropna(axis=1,thresh=3)

   2
0  2
1  5
2  6

In [42]:
df.dropna(axis=1,thresh=1)

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [45]:
# for finer-grained control,the thresh parameter lets you specify a minimum number of 
# non-null values for the row/column to be kept
df.dropna(axis='rows',thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [46]:
df.dropna(axis='columns',thresh=3)

   2
0  2
1  5
2  6

In [47]:
df.isna()

       0      1      2     3
0  False   True  False  True
1  False  False  False  True
2   True  False  False  True

In [48]:
df.notna()

       0      1     2      3
0   True  False  True  False
1   True   True  True  False
2  False   True  True  False

# filling null values

In [50]:
data=pd.Series([1,np.nan,2,None,3])
data

0    1.0
1    NaN
2    2.0
3    NaN
4    3.0
dtype: float64

In [51]:
data.fillna(0)

0    1.0
1    0.0
2    2.0
3    0.0
4    3.0
dtype: float64

In [52]:
data.fillna(method='ffill')

0    1.0
1    1.0
2    2.0
3    2.0
4    3.0
dtype: float64

In [53]:
data.fillna(method='bfill')

0    1.0
1    2.0
2    2.0
3    3.0
4    3.0
dtype: float64

In [54]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [55]:
df.fillna(method='ffill') # default is columns wise

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  2.0  4.0  6 NaN

In [56]:
df.fillna(method='ffill',axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [57]:
df.fillna(method='bfill',axis=1)

     0    1    2   3
0  1.0  2.0  2.0 NaN
1  2.0  3.0  5.0 NaN
2  4.0  4.0  6.0 NaN

In [58]:
df.fillna(0,axis=1)

     0    1    2    3
0  1.0  0.0  2.0  0.0
1  2.0  3.0  5.0  0.0
2  0.0  4.0  6.0  0.0

In [59]:
df.fillna(0,axis=0)

     0    1  2    3
0  1.0  0.0  2  0.0
1  2.0  3.0  5  0.0
2  0.0  4.0  6  0.0

In [60]:
df.fillna(5)

     0    1  2    3
0  1.0  5.0  2  5.0
1  2.0  3.0  5  5.0
2  5.0  4.0  6  5.0

In [69]:
df.fillna(df.mean())

     0    1  2   3
0  1.0  3.5  2 NaN
1  2.0  3.0  5 NaN
2  1.5  4.0  6 NaN

# HIERARCHICAL INDEXING

In [70]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [71]:
pop[('California',2010):('Texas',2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [72]:
pop[[i for i in pop.index if i[1]==2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

In [76]:
pop[[i for i in pop.index if i[1]==2000]]

(California, 2000)    33871648
(New York, 2000)      18976457
(Texas, 2000)         20851820
dtype: int64

In [77]:
index=pd.MultiIndex.from_tuples(index)

In [78]:
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [79]:
pop=pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [80]:
pop[:,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [81]:
pop.unstack()

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [83]:
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [84]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [88]:
df.unstack()

0  0    1.0
   1    2.0
   2    NaN
1  0    NaN
   1    3.0
   2    4.0
2  0    2.0
   1    5.0
   2    6.0
3  0    NaN
   1    NaN
   2    NaN
dtype: float64

In [89]:
df=pd.DataFrame({'total':pop,
                'under 18':[9267089,9284094,4687374,
                           5906301,4318033,6879014]})
df

                    total  under 18
California 2000  33871648   9267089
           2010  37253956   9284094
New York   2000  18976457   4687374
           2010  19378102   5906301
Texas      2000  20851820   4318033
           2010  25145561   6879014

In [91]:
percentage=(df['under 18']/df['total']).unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.304793
Texas       0.207082  0.273568

In [92]:
# This is how we make multi indexes 
data=pd.DataFrame(np.random.rand(4,2),
                 index=[['a','a','b','b'],[1,2,1,2]],
                 columns=['data1','data2'])
data

        data1     data2
a 1  0.213800  0.330148
  2  0.673910  0.239966
b 1  0.647598  0.343085
  2  0.498424  0.672611

In [93]:
data  = {('California', 2000):33871648,
         ('California', 2010): 37253956,
         ('New York', 2000): 18976457, 
         ('New York', 2010):19378102,
         ('Texas', 2000):20851820,
         ('Texas', 2010): 25145561}
data

{('California', 2000): 33871648,
 ('California', 2010): 37253956,
 ('New York', 2000): 18976457,
 ('New York', 2010): 19378102,
 ('Texas', 2000): 20851820,
 ('Texas', 2010): 25145561}

In [94]:
pd.Series(data)

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [95]:
pop.index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [96]:
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [98]:
pop.unstack()

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [99]:
pop.index.names=['state','year']

In [100]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [101]:
pop.unstack()

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [102]:
# data on health
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])

# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      52.0  34.8  46.0  36.1  47.0  38.3
     2      39.0  37.1  42.0  38.1  42.0  35.9
2014 1      30.0  35.3  20.0  37.2  25.0  38.3
     2      27.0  39.3  50.0  35.1  30.0  36.9

In [103]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      46.0  36.1
     2      42.0  38.1
2014 1      20.0  37.2
     2      50.0  35.1

In [104]:
health_data['Bob']

type          HR  Temp
year visit
2013 1      52.0  34.8
     2      39.0  37.1
2014 1      30.0  35.3
     2      27.0  39.3

In [106]:
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [108]:
pop['California',2000]

33871648

# sort tha data

In [109]:
df=pd.read_csv(r'/home/mohit/Desktop/4achivers/bank_client_information.csv')

In [110]:
df.head()

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22

In [111]:
df.sort_index()

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [112]:
df.sort_index(ascending=False)

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5

In [114]:
df.unstack()

First Name       0                      Bird
                 1                       Noah
                 2                       Nina
                 3                    Chanel
                 4                       Kate
                 5                      Samer
                 6                       Heba
                 7                      Laila
                 8                     Joseph
                 9                       Noah
Last Name        0                      Steve
                 1                      Small
                 2                     Keller
                 3                      Steve
                 4                       Noor
                 5                         Mo
                 6                     Ismail
                 7                      Ahmed
                 8                     Patton
                 9                      Moran
Email            0             bird@gmail.com
                 1         nsmall@hotmail.com
                 2            azikez@gahew.mr
                 3           chanel@gmail.com
                 4           kate@hotmail.com
                 5            samer@gmail.com
                 6    heba.ismail@hotmail.com
                 7        Laila.a@hotmail.com
                 8             daafeja@boh.jm
                 9          guutodi@bigwoc.kw
Postal Code      0                    N94 3M0
                 1                    N8S 14K
                 2                    S1T 4E6
                 3                    N7T 3E6
                 4                    K8N 5H6
                 5                    J7H 3HY
                 6                    K8Y 3M8
                 7                    J8Y 3M0
                 8                    M6U 5U7
                 9                    K2D 4M9
Net Worth        0                     5000.0
                 1                    10000.0
                 2                    9072.02
                 3                   11072.02
                 4                     5000.0
                 5                   100000.0
                 6                    50000.0
                 7                    20000.0
                 8                    2629.13
                 9                    8626.96
Years with Bank  0                          5
                 1                          6
                 2                          7
                 3                         10
                 4                         22
                 5                         26
                 6                         11
                 7                          3
                 8                          1
                 9                         13
dtype: object

In [115]:
df.unstack(level=0)

First Name       0                      Bird
                 1                       Noah
                 2                       Nina
                 3                    Chanel
                 4                       Kate
                 5                      Samer
                 6                       Heba
                 7                      Laila
                 8                     Joseph
                 9                       Noah
Last Name        0                      Steve
                 1                      Small
                 2                     Keller
                 3                      Steve
                 4                       Noor
                 5                         Mo
                 6                     Ismail
                 7                      Ahmed
                 8                     Patton
                 9                      Moran
Email            0             bird@gmail.com
                 1         nsmall@hotmail.com
                 2            azikez@gahew.mr
                 3           chanel@gmail.com
                 4           kate@hotmail.com
                 5            samer@gmail.com
                 6    heba.ismail@hotmail.com
                 7        Laila.a@hotmail.com
                 8             daafeja@boh.jm
                 9          guutodi@bigwoc.kw
Postal Code      0                    N94 3M0
                 1                    N8S 14K
                 2                    S1T 4E6
                 3                    N7T 3E6
                 4                    K8N 5H6
                 5                    J7H 3HY
                 6                    K8Y 3M8
                 7                    J8Y 3M0
                 8                    M6U 5U7
                 9                    K2D 4M9
Net Worth        0                     5000.0
                 1                    10000.0
                 2                    9072.02
                 3                   11072.02
                 4                     5000.0
                 5                   100000.0
                 6                    50000.0
                 7                    20000.0
                 8                    2629.13
                 9                    8626.96
Years with Bank  0                          5
                 1                          6
                 2                          7
                 3                         10
                 4                         22
                 5                         26
                 6                         11
                 7                          3
                 8                          1
                 9                         13
dtype: object

In [116]:
df.unstack(level=1)

First Name       0                      Bird
                 1                       Noah
                 2                       Nina
                 3                    Chanel
                 4                       Kate
                 5                      Samer
                 6                       Heba
                 7                      Laila
                 8                     Joseph
                 9                       Noah
Last Name        0                      Steve
                 1                      Small
                 2                     Keller
                 3                      Steve
                 4                       Noor
                 5                         Mo
                 6                     Ismail
                 7                      Ahmed
                 8                     Patton
                 9                      Moran
Email            0             bird@gmail.com
                 1         nsmall@hotmail.com
                 2            azikez@gahew.mr
                 3           chanel@gmail.com
                 4           kate@hotmail.com
                 5            samer@gmail.com
                 6    heba.ismail@hotmail.com
                 7        Laila.a@hotmail.com
                 8             daafeja@boh.jm
                 9          guutodi@bigwoc.kw
Postal Code      0                    N94 3M0
                 1                    N8S 14K
                 2                    S1T 4E6
                 3                    N7T 3E6
                 4                    K8N 5H6
                 5                    J7H 3HY
                 6                    K8Y 3M8
                 7                    J8Y 3M0
                 8                    M6U 5U7
                 9                    K2D 4M9
Net Worth        0                     5000.0
                 1                    10000.0
                 2                    9072.02
                 3                   11072.02
                 4                     5000.0
                 5                   100000.0
                 6                    50000.0
                 7                    20000.0
                 8                    2629.13
                 9                    8626.96
Years with Bank  0                          5
                 1                          6
                 2                          7
                 3                         10
                 4                         22
                 5                         26
                 6                         11
                 7                          3
                 8                          1
                 9                         13
dtype: object

In [117]:
df.unstack()

First Name       0                      Bird
                 1                       Noah
                 2                       Nina
                 3                    Chanel
                 4                       Kate
                 5                      Samer
                 6                       Heba
                 7                      Laila
                 8                     Joseph
                 9                       Noah
Last Name        0                      Steve
                 1                      Small
                 2                     Keller
                 3                      Steve
                 4                       Noor
                 5                         Mo
                 6                     Ismail
                 7                      Ahmed
                 8                     Patton
                 9                      Moran
Email            0             bird@gmail.com
                 1         nsmall@hotmail.com
                 2            azikez@gahew.mr
                 3           chanel@gmail.com
                 4           kate@hotmail.com
                 5            samer@gmail.com
                 6    heba.ismail@hotmail.com
                 7        Laila.a@hotmail.com
                 8             daafeja@boh.jm
                 9          guutodi@bigwoc.kw
Postal Code      0                    N94 3M0
                 1                    N8S 14K
                 2                    S1T 4E6
                 3                    N7T 3E6
                 4                    K8N 5H6
                 5                    J7H 3HY
                 6                    K8Y 3M8
                 7                    J8Y 3M0
                 8                    M6U 5U7
                 9                    K2D 4M9
Net Worth        0                     5000.0
                 1                    10000.0
                 2                    9072.02
                 3                   11072.02
                 4                     5000.0
                 5                   100000.0
                 6                    50000.0
                 7                    20000.0
                 8                    2629.13
                 9                    8626.96
Years with Bank  0                          5
                 1                          6
                 2                          7
                 3                         10
                 4                         22
                 5                         26
                 6                         11
                 7                          3
                 8                          1
                 9                         13
dtype: object

# set index

In [124]:
df.set_index(['First Name'])

,Last Name,Email,Postal Code,Net Worth,Years with Bank
First Name,,,,,
Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [125]:
df.set_index(['First Name','Last Name'])

,,Email,Postal Code,Net Worth,Years with Bank
First Name,Last Name,,,,
Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [126]:
df.set_index(['First Name'],inplace=True)

In [127]:
df

,Last Name,Email,Postal Code,Net Worth,Years with Bank
First Name,,,,,
Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

# reset index

In [128]:
df.reset_index()

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [129]:
df

,Last Name,Email,Postal Code,Net Worth,Years with Bank
First Name,,,,,
Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [130]:
df.reset_index(inplace=True) # inplace True will changes for permanent

In [131]:
df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [137]:
df.sort_index()

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [141]:
df.sort_index(ascending=False)

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5